Repository: AlibekDalgat/xblock-poll
Catalog: poll/translations/*/LC_MESSAGES/text.po
Languages: ru

source: Whether or not to display results to the user.
ru: Отображать ли результаты пользователю.

source: The maximum number of times a user may send a submission.
ru: Максимальное количество отправок ответа пользователем.

source: Number of times the user has sent a submission.
ru: Количество отправленных пользователем ответов.

source: Text to display after the user votes.
ru: Текст, отображаемый после голосования пользователя.

source: '{field}' is not present, or not a JSON array.
ru: '{field}' отсутствует или не является массивом JSON.

source: {noun} {item} not a javascript object!
ru: {noun} {item} не является объектом JavaScript!

source: {noun} {item} contains no key.
ru: {noun} {item} не содержит ключа.

source: {noun} has no text or img. Please make sure all {noun_lower}s have one or the other, or both.
ru: {noun} не содержит текста или изображения. Убедитесь, что все {noun_lower} имеют текст, изображение или оба.

source: {noun} was added with no label. All {noun_lower}s must have labels. Please check the form. Check the form and explicitly delete {noun_lower}s if not needed.
ru: {noun} добавлен без метки. Все {noun_lower} должны иметь метки. Проверьте форму и явно удалите {noun_lower}, если они не нужны.

source: All images must have an alternative text describing the image in a way that would allow someone to answer the poll if the image did not load.
ru: Все изображения должны иметь альтернативный текст, описывающий изображение таким образом, чтобы пользователь мог ответить на опрос, если изображение не загрузилось.

source: You must include at least one {noun_lower}.
ru: Необходимо включить хотя бы один {noun_lower}.

source: Maximum Submissions missing or not an integer.
ru: Максимальное количество отправок отсутствует или не является целым числом.

source: Private results may not be False when Maximum Submissions is not 1.
ru: Приватные результаты не могут быть False, если максимальное количество отправок не равно 1.

source: Poll
ru: Опрос

source: What is your favorite color?
ru: Какой ваш любимый цвет?

source: Red
ru: Красный

source: Blue
ru: Синий

source: Green
ru: Зеленый

source: Other
ru: Другое

source: The answer options on this poll.
ru: Варианты ответов на этот опрос.

source: Total tally of answers from students.
ru: Общее количество ответов от студентов.

source: The student's answer
ru: Ответ студента

source: You have already voted in this poll.
ru: Вы уже проголосовали в этом опросе.

source: Answer not included with request.
ru: Ответ не включен в запрос.

source: No key "{choice}" in answers table.
ru: Ключ "{choice}" отсутствует в таблице ответов.

source: You have already voted as many times as you are allowed.
ru: Вы уже проголосовали максимальное количество раз.

source: You must specify a question.
ru: Необходимо указать вопрос.

source: Answer
ru: Ответ

source: Question
ru: Вопрос

source: Submissions count
ru: Количество отправок

source: Survey
ru: Анкета

source: Yes
ru: Да

source: No
ru: Нет

source: Maybe
ru: Возможно

source: Answer choices for this Survey
ru: Варианты ответов для этой анкеты

source: Are you enjoying the course?
ru: Нравится ли вам курс?

source: Would you recommend this course to your friends?
ru: Порекомендовали бы вы этот курс своим друзьям?

source: Do you think you will learn a lot?
ru: Считаете ли вы, что многому научитесь?

source: Questions for this Survey
ru: Вопросы для этой анкеты

source: The user's answers
ru: Ответы пользователя

source: Not all questions were included, or unknown questions were included. Try refreshing and trying again.
ru: Не все вопросы были включены, или были включены неизвестные вопросы. Попробуйте обновить и повторить.

source: Found unknown answer '{answer_key}' for question key '{question_key}'
ru: Найден неизвестный ответ '{answer_key}' для ключа вопроса '{question_key}'

source: Submit
ru: Отправить

source: Thank you.
ru: Спасибо.

source: You have used %(submissions_count_s)s out of %(max_submissions_s)s submissions.
ru: Вы использовали %(submissions_count_s)s из %(max_submissions_s)s отправок.

source: Feedback
ru: Отзыв

source: View results
ru: Посмотреть результаты

source: Export results to CSV
ru: Экспортировать результаты в CSV

source: Download CSV
ru: Скачать CSV

source: Student data and results CSV available for download in the LMS.
ru: Данные студентов и результаты в формате CSV доступны для скачивания в LMS.

source: Display Name
ru: Название

source: Question/Prompt
ru: Вопрос/Подсказка

source: %(link_start)sMarkdown Syntax%(link_end)s is supported.
ru: Поддерживается %(link_start)sсинтаксис Markdown%(link_end)s.

source: Enter the prompt for the user.
ru: Введите подсказку для пользователя.

source: %(link_start)sMarkdown Syntax%(link_end)s is supported.
ru: Поддерживается %(link_start)sсинтаксис Markdown%(link_end)s.

source: This text will be displayed for the user as some extra feedback after they have submitted their response to the poll.
ru: Этот текст будет отображаться для пользователя как дополнительная обратная связь после отправки ответа на опрос.

source: Private Results
ru: Приватные результаты

source: True
ru: Истина

source: False
ru: Ложь

source: If this is set to True, don't display results of the poll to the user.
ru: Если установлено Истина, результаты опроса не отображаются пользователю.

source: Maximum Submissions
ru: Максимальное количество отправок

source: Maximum number of times a user may submit a poll. %(bold_start)sSetting this to a value other than 1 will imply that 'Private Results' should be true.%(bold_end)s Setting it to 0 will allow infinite resubmissions.
ru: Максимальное количество отправок опроса пользователем. %(bold_start)sУстановка значения, отличного от 1, подразумевает, что 'Приватные результаты' должны быть истинными.%(bold_end)s Установка 0 разрешает бесконечные отправки.

source: Notes:
ru: Примечания:

source: If you change an answer's text, all students who voted for that choice will have their votes updated to the new text. You'll want to avoid changing an answer from something like 'True' to 'False', accordingly. If you delete an answer, any votes for that answer will also be deleted. Students whose choices are deleted may vote again, but will not lose course progress.
ru: Если вы измените текст ответа, все голоса студентов за этот вариант будут обновлены на новый текст. Поэтому следует избегать изменения ответа, например, с 'Истина' на 'Ложь'. При удалении ответа все голоса за него также будут удалены. Студенты, чьи ответы удалены, могут проголосовать снова, но не потеряют прогресс курса.

source: Questions must be similarly cared for. If a question's text is changed, any votes for that question will remain. If a question is deleted, any student who previously took the survey will be permitted to retake it, but will not lose course progress.
ru: С вопросами нужно обращаться так же осторожно. Если текст вопроса изменен, все голоса за этот вопрос сохранятся. Если вопрос удален, любой студент, ранее участвовавший в анкете, сможет пройти ее снова, но не потеряет прогресс курса.

source: Add Answer
ru: Добавить ответ

source: Add Question
ru: Добавить вопрос

source: Save
ru: Сохранить

source: Cancel
ru: Отмена
